import { createSlice } from "@reduxjs/toolkit";

export const sliceData = createSlice({
  name: 'sliceData',
  initialState: [
    {
      name: 'Химчистка',
      clothes: [
        {
          type: 'Аксессуары',
          clothes_type: []
        },
        {
          type: 'Верхняя одежда',
          clothes_type: [
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 1400
            },
            {
              name: 'Ветровка',
              price: 520
            },
            {
              name: 'Ветровка (натуральный шелк)',
              price: 3000
            },
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 11000
            }
          ]
        },
        {
          type: 'Деловой костюм',
          clothes_type: [
            {
              name: 'Пиджак',
              price: 1400
            },
            {
              name: 'Пиджак натуральный шелк',
              price: 520
            },
            {
              name: 'Пиджак с коротким рукавом без подклада',
              price: 3000
            },
            {
              name: 'Пиджак натуральный шёлк с коротким рукавом',
              price: 11000
            }
          ]
        },
        {
          type: 'Джинса',
          clothes_type: []
        },
        {
          type: 'Куртка и пуховик',
          clothes_type: []
        },
        {
          type: 'Пальто и плащ',
          clothes_type: []
        }
      ]
    },
    {
      name: 'Аквачистка',
      clothes: [
        {
          type: 'Аксессуары',
          clothes_type: []
        },
        {
          type: 'Верхняя одежда',
          clothes_type: [
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 1400
            },
            {
              name: 'Ветровка',
              price: 520
            },
            {
              name: 'Ветровка (натуральный шелк)',
              price: 3000
            },
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 11000
            }
          ]
        },
        {
          type: 'Деловой костюм',
          clothes_type: [
            {
              name: 'Пиджак',
              price: 1400
            },
            {
              name: 'Пиджак натуральный шелк',
              price: 520
            },
            {
              name: 'Пиджак с коротким рукавом без подклада',
              price: 3000
            },
            {
              name: 'Пиджак натуральный шёлк с коротким рукавом',
              price: 11000
            }
          ]
        },
        {
          type: 'Джинса',
          clothes_type: []
        },
        {
          type: 'Куртка и пуховик',
          clothes_type: []
        },
        {
          type: 'Пальто и плащ',
          clothes_type: []
        }
      ]
    },
    {
      name: 'Ремонт одежды',
      clothes: [
        {
          type: 'Аксессуары',
          clothes_type: []
        },
        {
          type: 'Верхняя одежда',
          clothes_type: [
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 1400
            },
            {
              name: 'Ветровка',
              price: 520
            },
            {
              name: 'Ветровка (натуральный шелк)',
              price: 3000
            },
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 11000
            }
          ]
        },
        {
          type: 'Деловой костюм',
          clothes_type: [
            {
              name: 'Пиджак',
              price: 1400
            },
            {
              name: 'Пиджак натуральный шелк',
              price: 520
            },
            {
              name: 'Пиджак с коротким рукавом без подклада',
              price: 3000
            },
            {
              name: 'Пиджак натуральный шёлк с коротким рукавом',
              price: 11000
            }
          ]
        },
        {
          type: 'Джинса',
          clothes_type: []
        },
        {
          type: 'Куртка и пуховик',
          clothes_type: []
        },
        {
          type: 'Пальто и плащ',
          clothes_type: []
        }
      ]
    },
    {
      name: 'Химчистка',
      clothes: [
        {
          type: 'Аксессуары',
          clothes_type: []
        },
        {
          type: 'Верхняя одежда',
          clothes_type: [
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 1400
            },
            {
              name: 'Ветровка',
              price: 520
            },
            {
              name: 'Ветровка (натуральный шелк)',
              price: 3000
            },
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 11000
            }
          ]
        },
        {
          type: 'Деловой костюм',
          clothes_type: [
            {
              name: 'Пиджак',
              price: 1400
            },
            {
              name: 'Пиджак натуральный шелк',
              price: 520
            },
            {
              name: 'Пиджак с коротким рукавом без подклада',
              price: 3000
            },
            {
              name: 'Пиджак натуральный шёлк с коротким рукавом',
              price: 11000
            }
          ]
        },
        {
          type: 'Джинса',
          clothes_type: []
        },
        {
          type: 'Куртка и пуховик',
          clothes_type: []
        },
        {
          type: 'Пальто и плащ',
          clothes_type: []
        }
      ]
    },
    {
      name: 'Аквачистка',
      clothes: [
        {
          type: 'Аксессуары',
          clothes_type: []
        },
        {
          type: 'Верхняя одежда',
          clothes_type: [
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 1400
            },
            {
              name: 'Ветровка',
              price: 520
            },
            {
              name: 'Ветровка (натуральный шелк)',
              price: 3000
            },
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 11000
            }
          ]
        },
        {
          type: 'Деловой костюм',
          clothes_type: [
            {
              name: 'Пиджак',
              price: 1400
            },
            {
              name: 'Пиджак натуральный шелк',
              price: 520
            },
            {
              name: 'Пиджак с коротким рукавом без подклада',
              price: 3000
            },
            {
              name: 'Пиджак натуральный шёлк с коротким рукавом',
              price: 11000
            }
          ]
        },
        {
          type: 'Джинса',
          clothes_type: []
        },
        {
          type: 'Куртка и пуховик',
          clothes_type: []
        },
        {
          type: 'Пальто и плащ',
          clothes_type: []
        }
      ]
    },
    {
      name: 'Ремонт одежды',
      clothes: [
        {
          type: 'Аксессуары',
          clothes_type: []
        },
        {
          type: 'Верхняя одежда',
          clothes_type: [
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 1400
            },
            {
              name: 'Ветровка',
              price: 520
            },
            {
              name: 'Ветровка (натуральный шелк)',
              price: 3000
            },
            {
              name: 'Пальто, полупальто с подстежкой из натурального меха',
              price: 11000
            }
          ]
        },
        {
          type: 'Деловой костюм',
          clothes_type: [
            {
              name: 'Пиджак',
              price: 1400
            },
            {
              name: 'Пиджак натуральный шелк',
              price: 520
            },
            {
              name: 'Пиджак с коротким рукавом без подклада',
              price: 3000
            },
            {
              name: 'Пиджак натуральный шёлк с коротким рукавом',
              price: 11000
            }
          ]
        },
        {
          type: 'Джинса',
          clothes_type: []
        },
        {
          type: 'Куртка и пуховик',
          clothes_type: []
        },
        {
          type: 'Пальто и плащ',
          clothes_type: []
        }
      ]
    }
  ]
});

export default sliceData.reducer