const clothes = {
  outerwear: [
    {
      name: 'Пальто, полупальто с подстежкой из натурального меха',
      price: 1400
    },
    {
      name: 'Ветровка',
      price: 520
    },
    {
      name: 'Ветровка (натуральный шелк)',
      price: 3000
    },
    {
      name: 'Пальто, полупальто с подстежкой из натурального меха',
      price: 11000
    }
  ],
  businessSuit: [
    {
      name: 'Пиджак',
      price: 1400
    },
    {
      name: 'Пиджак натуральный шелк',
      price: 520
    },
    {
      name: 'Пиджак с коротким рукавом без подклада',
      price: 3000
    },
    {
      name: 'Пиджак натуральный шёлк с коротким рукавом',
      price: 11000
    }
  ]
}

const list = {
  services: ['Химчистка', 'Аквачистка', 'Ремонт одежды', 'Химчистка', 'Аквачистка', 'Ремонт одежды'],
  clothes: ['Аксессуары', 'Верхняя одежда', 'Деловой костюм', 'Джинса', 'Куртка и пуховик', 'Пальто и плащ']
};

export const data = [
  {
    name: 'Химчистка',
    clothes: [
      {
        type: 'Аксессуары',
        clothes_type: []
      },
      {
        type: 'Верхняя одежда',
        clothes_type: [
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 1400
          },
          {
            name: 'Ветровка',
            price: 520
          },
          {
            name: 'Ветровка (натуральный шелк)',
            price: 3000
          },
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 11000
          }
        ]
      },
      {
        type: 'Деловой костюм',
        clothes_type: [
          {
            name: 'Пиджак',
            price: 1400
          },
          {
            name: 'Пиджак натуральный шелк',
            price: 520
          },
          {
            name: 'Пиджак с коротким рукавом без подклада',
            price: 3000
          },
          {
            name: 'Пиджак натуральный шёлк с коротким рукавом',
            price: 11000
          }
        ]
      },
      {
        type: 'Джинса',
        clothes_type: []
      },
      {
        type: 'Куртка и пуховик',
        clothes_type: []
      },
      {
        type: 'Пальто и плащ',
        clothes_type: []
      }
    ]
  },
  {
    name: 'Аквачистка',
    clothes: [
      {
        type: 'Аксессуары',
        clothes_type: []
      },
      {
        type: 'Верхняя одежда',
        clothes_type: [
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 1400
          },
          {
            name: 'Ветровка',
            price: 520
          },
          {
            name: 'Ветровка (натуральный шелк)',
            price: 3000
          },
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 11000
          }
        ]
      },
      {
        type: 'Деловой костюм',
        clothes_type: [
          {
            name: 'Пиджак',
            price: 1400
          },
          {
            name: 'Пиджак натуральный шелк',
            price: 520
          },
          {
            name: 'Пиджак с коротким рукавом без подклада',
            price: 3000
          },
          {
            name: 'Пиджак натуральный шёлк с коротким рукавом',
            price: 11000
          }
        ]
      },
      {
        type: 'Джинса',
        clothes_type: []
      },
      {
        type: 'Куртка и пуховик',
        clothes_type: []
      },
      {
        type: 'Пальто и плащ',
        clothes_type: []
      }
    ]
  },
  {
    name: 'Ремонт одежды',
    clothes: [
      {
        type: 'Аксессуары',
        clothes_type: []
      },
      {
        type: 'Верхняя одежда',
        clothes_type: [
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 1400
          },
          {
            name: 'Ветровка',
            price: 520
          },
          {
            name: 'Ветровка (натуральный шелк)',
            price: 3000
          },
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 11000
          }
        ]
      },
      {
        type: 'Деловой костюм',
        clothes_type: [
          {
            name: 'Пиджак',
            price: 1400
          },
          {
            name: 'Пиджак натуральный шелк',
            price: 520
          },
          {
            name: 'Пиджак с коротким рукавом без подклада',
            price: 3000
          },
          {
            name: 'Пиджак натуральный шёлк с коротким рукавом',
            price: 11000
          }
        ]
      },
      {
        type: 'Джинса',
        clothes_type: []
      },
      {
        type: 'Куртка и пуховик',
        clothes_type: []
      },
      {
        type: 'Пальто и плащ',
        clothes_type: []
      }
    ]
  },
  {
    name: 'Химчистка',
    clothes: [
      {
        type: 'Аксессуары',
        clothes_type: []
      },
      {
        type: 'Верхняя одежда',
        clothes_type: [
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 1400
          },
          {
            name: 'Ветровка',
            price: 520
          },
          {
            name: 'Ветровка (натуральный шелк)',
            price: 3000
          },
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 11000
          }
        ]
      },
      {
        type: 'Деловой костюм',
        clothes_type: [
          {
            name: 'Пиджак',
            price: 1400
          },
          {
            name: 'Пиджак натуральный шелк',
            price: 520
          },
          {
            name: 'Пиджак с коротким рукавом без подклада',
            price: 3000
          },
          {
            name: 'Пиджак натуральный шёлк с коротким рукавом',
            price: 11000
          }
        ]
      },
      {
        type: 'Джинса',
        clothes_type: []
      },
      {
        type: 'Куртка и пуховик',
        clothes_type: []
      },
      {
        type: 'Пальто и плащ',
        clothes_type: []
      }
    ]
  },
  {
    name: 'Аквачистка',
    clothes: [
      {
        type: 'Аксессуары',
        clothes_type: []
      },
      {
        type: 'Верхняя одежда',
        clothes_type: [
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 1400
          },
          {
            name: 'Ветровка',
            price: 520
          },
          {
            name: 'Ветровка (натуральный шелк)',
            price: 3000
          },
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 11000
          }
        ]
      },
      {
        type: 'Деловой костюм',
        clothes_type: [
          {
            name: 'Пиджак',
            price: 1400
          },
          {
            name: 'Пиджак натуральный шелк',
            price: 520
          },
          {
            name: 'Пиджак с коротким рукавом без подклада',
            price: 3000
          },
          {
            name: 'Пиджак натуральный шёлк с коротким рукавом',
            price: 11000
          }
        ]
      },
      {
        type: 'Джинса',
        clothes_type: []
      },
      {
        type: 'Куртка и пуховик',
        clothes_type: []
      },
      {
        type: 'Пальто и плащ',
        clothes_type: []
      }
    ]
  },
  {
    name: 'Ремонт одежды',
    clothes: [
      {
        type: 'Аксессуары',
        clothes_type: []
      },
      {
        type: 'Верхняя одежда',
        clothes_type: [
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 1400
          },
          {
            name: 'Ветровка',
            price: 520
          },
          {
            name: 'Ветровка (натуральный шелк)',
            price: 3000
          },
          {
            name: 'Пальто, полупальто с подстежкой из натурального меха',
            price: 11000
          }
        ]
      },
      {
        type: 'Деловой костюм',
        clothes_type: [
          {
            name: 'Пиджак',
            price: 1400
          },
          {
            name: 'Пиджак натуральный шелк',
            price: 520
          },
          {
            name: 'Пиджак с коротким рукавом без подклада',
            price: 3000
          },
          {
            name: 'Пиджак натуральный шёлк с коротким рукавом',
            price: 11000
          }
        ]
      },
      {
        type: 'Джинса',
        clothes_type: []
      },
      {
        type: 'Куртка и пуховик',
        clothes_type: []
      },
      {
        type: 'Пальто и плащ',
        clothes_type: []
      }
    ]
  }
]